:PROPERTIES:
:ID:       36073d96-d95e-4bd5-ab4b-2abb6c3ca27a
:END:
# SPDX-FileCopyrightText: 2024 László Vaskó <vlaci@fastmail.com>
#
# SPDX-License-Identifier: EUPL-1.2
#+title: Razorback

This is the configuration for my home desktop. It is after the racing ship /Razorback/ from the Expanse Novels[cite:@noauthor_razorback_nodate].

#+caption: flake.nix:outputs
#+begin_src nix :noweb no-export :noweb-ref flake-outputs
nixosModules.razorback = {
  networking.hostName = "razorback";
  imports = [
    <<razorback-modules>>
  ];
};
nixosConfigurations.razorback = self.lib.mkNixOS {
  modules = [ self.nixosModules.razorback ];
};
#+end_src

Hardware configuration generated using =nixos-generate-config=:

#+NAME: razorback-hardware-configuration
#+begin_src emacs-lisp :eval yes :results raw
(let ((out (shell-command-to-string
            (concat "2>/dev/null "
                    "nixos-generate-config --no-filesystems --show-hardware-config"
                    "| nixfmt"))))
  (concat "#+caption: hosts/razorback/hardware-configuration.nix\n"
          "#+begin_src nix :mkdirp yes :tangle out/hosts/razorback/hardware-configuration.nix\n"
          out
          "#+end_src"))
#+end_src

#+RESULTS: razorback-hardware-configuration
#+caption: hosts/razorback/hardware-configuration.nix
#+begin_src nix :mkdirp yes :tangle out/hosts/razorback/hardware-configuration.nix
# Do not modify this file!  It was generated by ‘nixos-generate-config’
# and may be overwritten by future invocations.  Please make changes
# to /etc/nixos/configuration.nix instead.
{
  config,
  lib,
  pkgs,
  modulesPath,
  ...
}:

{
  imports = [
    (modulesPath + "/installer/scan/not-detected.nix")
  ];

  boot.initrd.availableKernelModules = [
    "nvme"
    "xhci_pci"
    "ahci"
    "thunderbolt"
    "usbhid"
  ];
  boot.initrd.kernelModules = [ "dm-snapshot" ];
  boot.kernelModules = [ "kvm-amd" ];
  boot.extraModulePackages = [ ];

  # Enables DHCP on each ethernet and wireless interface. In case of scripted networking
  # (the default) this is the recommended approach. When using systemd-networkd it's
  # still possible to use this option, but it's recommended to use it in conjunction
  # with explicit per-interface declarations with `networking.interfaces.<interface>.useDHCP`.
  networking.useDHCP = lib.mkDefault true;
  # networking.interfaces.docker0.useDHCP = lib.mkDefault true;
  # networking.interfaces.enp12s0.useDHCP = lib.mkDefault true;
  # networking.interfaces.enp13s0.useDHCP = lib.mkDefault true;
  # networking.interfaces.virbr0.useDHCP = lib.mkDefault true;

  nixpkgs.hostPlatform = lib.mkDefault "x86_64-linux";
  hardware.cpu.amd.updateMicrocode = lib.mkDefault config.hardware.enableRedistributableFirmware;
}
#+end_src

#+caption: nixos/razorback
#+begin_src nix :noweb no-export :noweb-ref razorback-modules
./hosts/razorback/hardware-configuration.nix
#+end_src

